#### MetallicpaintFlecksType Enumeration

---

|  |
| --- |
| See Also |

The enumerated type representing the permitted values for the asset property "MetallicpaintFlecks" from the "MetallicPaint" schema.

**Namespace:**   Autodesk.Revit.DB.Visual
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)

# Syntax

| C# |
| --- |
| ``` public enum MetallicpaintFlecksType ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration MetallicpaintFlecksType ``` |

| Visual C++ |
| --- |
| ``` public enum class MetallicpaintFlecksType ``` |

# Members

| Member name | Description |
| --- | --- |
| None |  |
| Enable |  |

# See Also

Autodesk.Revit.DB.Visual Namespace